In [2]:
import sqlite3
import pandas as pd

db = sqlite3.connect('IMDB.sqlite')

In [3]:
db

In [4]:
db = sqlite3.connect('IMDB_1.sqlite')
db

In [5]:
db = sqlite3.connect('School.sqlite')
db

In [6]:
cur = db.cursor()
cur

In [7]:
sql_query = 'Create table Student (RollNumber int Primary key, Name text, Age int)'
cur.execute(sql_query)

OperationalError: table Student already exists

In [ ]:
cur.execute("Insert into Student values(101,'Aman',15)")

In [ ]:
db.commit()

In [ ]:
#cur.execute("Insert into Student values(101,'Aman',15)")
cur.execute("Insert into Student values(102,'Amit',16)")
cur.execute("Insert into Student values(103,'Amrita',17)")
cur.execute("Insert into Student values(104,'Amisha',18)")
cur.execute("Insert into Student values(105,'Aniket',19)")
cur.execute("Insert into Student values(106,'Bhawna',20)")
cur.execute("Insert into Student values(107,'Bhawuk',15)")
cur.execute("Insert into Student values(108,'Chetan',16)")
cur.execute("Insert into Student values(109,'Chetna',17)")
cur.execute("Insert into Student values(110,'Goyal',21)")
cur.execute("Insert into Student values(111,'Harshita',21)")

In [ ]:
db.commit()

In [ ]:
cur.execute("Select * from Student where age = 21")
rows = cur.fetchall()
for row in rows:
    print(row)

(110, 'Goyal', 21)
(111, 'Harshita', 21)

In [ ]:
db.commit()

In [ ]:
# ? works as a placeholder in sqlite3 for providinv values in sql query from variables
rn = 112
name = 'Sonal'
age = 20

cur.execute("Insert into Student values(?,?,?)",(rn,name,age))
db.commit()

In [8]:
data = pd.read_sql_query("Select * from Student",db)

In [9]:
data

    RollNumber      Name  Age
0          101      Aman   15
1          102      Amit   16
2          103    Amrita   17
3          104    Amisha   18
4          105    Aniket   19
5          106    Bhawna   20
6          107    Bhawuk   15
7          108    Chetan   16
8          109    Chetna   17
9          110     Goyal   21
10         111  Harshita   21
11         112     Sonal   20

In [11]:
data[data["Age"] == 20]

    RollNumber    Name  Age
5          106  Bhawna   20
11         112   Sonal   20

In [12]:
data2 = pd.DataFrame([[202,"Aman","English",20000],[203,"Komal","Maths",30000],[204,"Mahesh","Science",40000]],columns=["Faculty_ID","Name","Subject","Salary"])

In [13]:
data2

   Faculty_ID    Name  Subject  Salary
0         202    Aman  English   20000
1         203   Komal    Maths   30000
2         204  Mahesh  Science   40000

In [14]:
data2.to_sql("Faculty",db)